# HookLength1 Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
RebarBendData..::..HookLength1 Property
RebarBendData Class See Also
---
The extension length of the hook at the end.
**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2012
# Syntax
C#
---
```text
public double HookLength1 { get; set; }
```

Visual Basic
---
```text
Public Property HookLength1 As Double
	Get
	Set
```

Visual C++
---
```text
public:
property double HookLength1 {
	double get ();
	void set (double value);
}
```

# See Also
RebarBendData Class
Autodesk.Revit.DB.Structure Namespace